package commands;

/**
 * Интерфейс за реализация на шаблона "Command".
 * Всички потребителски команди трябва да имплементират този интерфейс.
 */
public interface Command {
    /**
     * Изпълнява логиката на конкретната команда.
     * @param args Масив от низове, съдържащ параметрите на командата.
     * @return Резултат от изпълнението като низ, готов за принтиране.
     */
    String execute(String[] args);

    /**
     * Връща уникалното име на командата.
     * @return Името на командата.
     */
    String getName();
}